Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "dma.h"
#include "memorymap.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "FreeRTOS.h"
#include "task.h"
#include "stm32h7xx_nucleo.h"
#include "croutine.h"
#include "timerForDebug.h"
#include "iwdg.h"
#include "wwdg.h"
#include "delay.h"
#include "rtc_timeStamp.h"
#include "bootLoader.h"
#include "cpu_flash.h"
#include "queue.h"
#include "stm32h7xx.h"
#include "event_groups.h"
#include "semphr.h"
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* 定义�?512KB AXI SRAM里面的变�? */
#pragma location = ".RAM_D1"  
uint32_t AXISRAMBuf[10];
#pragma location = ".RAM_D1"  
uint16_t AXISRAMCount;

/* 定义�?128KB SRAM1(0x30000000) + 128KB SRAM2(0x30020000) + 32KB SRAM3(0x30040000)里面的变�? */
#pragma location = ".RAM_D2" 
uint32_t D2SRAMBuf[10];
#pragma location = ".RAM_D2" 
uint16_t D2SRAMCount;

/* 定义�?64KB SRAM4(0x38000000)里面的变�? */
#pragma location = ".RAM_D3"  
uint32_t D3SRAMBuf[10];
#pragma location = ".RAM_D3"  
uint16_t D3SRAMCount;

#pragma location = ".RAM_BKP"
uint32_t BKPSRAMBuf[10];
#pragma location = ".RAM_BKP"
uint16_t BKPSRAMCount;

/* 
   1、将�?个扇区的空间预留出来做为参数区，这里是将�?2个扇区作为参数区�?
      默认情况下不要将�?1个扇区做参数区，因为�?1个扇区是默认的boot启动地址�?
   2、�?�过这种定义方式告诉编译器，此空间已经被占用，不让编译器再为这个空间编写程序�?
*/
#pragma location=0x08000000 + 128*1024
const uint8_t para_flash_area[128 * 1024];
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
extern IWDG_HandleTypeDef IwdgHandle;
extern WWDG_HandleTypeDef   WwdgHandle;
extern uint32_t wwdgDelayNum;
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
typedef struct
{
  uint8_t ParamVer;
  uint16_t ucBackLight;
  uint32_t Baud485;
  float ucRadioMode;
}PARAM_T;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void vTaskTaskUserIF(void *pvParameters);
static void vTaskLED(void *pvParameters);
static void vTaskMsgPro(void *pvParameters);
static void vTaskStart(void *pvParameters);
static void AppTaskCreate (void);
static void vTaskIwdg(void *pvParameters);
static void vTaskWwdg(void *pvParameters);
//static void vTaskMsgPro2(void *pvParameters);

static TaskHandle_t xHandleTaskUserIF = NULL;
static TaskHandle_t xHandleTaskLED = NULL;
static TaskHandle_t xHandleTaskMsgPro = NULL;
static TaskHandle_t xHandleTaskStart = NULL;
static TaskHandle_t xHandleTaskIwdg = NULL;
static TaskHandle_t xHandleTaskWwdg = NULL;
//static TaskHandle_t xHandleTaskMsgPro2 = NULL;

static EventGroupHandle_t xHandleEventGroup;

static QueueHandle_t xQueue1 = NULL;
static QueueHandle_t xQueue2 = NULL;
static QueueHandle_t xQueue3 = NULL;

static SemaphoreHandle_t xHandleSemaphoreCounting = NULL;
static SemaphoreHandle_t xHandleSemaphoreBinary = NULL;
static SemaphoreHandle_t xHandleSemaphoreMutex = NULL;

typedef struct Msg
{
  uint8_t ucMessageID;
  uint16_t usData[2];
  uint32_t ulData[2];
}MSG_T;

MSG_T   g_tMsg;

uint32_t UserButtonStatus = 0;  /* set to 1 after User Button interrupt  */

TimerHandle_t xTimers[2];
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static void vTimerCallback(xTimerHandle pxTimer)
{
    uint32_t ulTimerID;
    
    ulTimerID = (uint32_t)pvTimerGetTimerID(pxTimer);
    
    if(ulTimerID == 0)
    {
      //printf("software timer 0\r\n");
    }
    
    if(ulTimerID == 1)
    {
      //printf("software timer 1\r\n");
    }
}

static void AppObjCreate(void)
{
  /*用于测试动态内存分配的消息队列*/
  xQueue3 = xQueueCreate(10, sizeof(struct Msg *));
  if(xQueue3 == NULL)
  {
    printf("create xQueue3 failed\r\n");
  }
  else
  {
    printf("create xQueue3 success\r\n");
  }
  
  /*初始化1个信号量可用资源*/
  xHandleSemaphoreCounting = xSemaphoreCreateCounting(1,0);
  
  /*创建二值信号量*/
  xHandleSemaphoreBinary = xSemaphoreCreateBinary();
  
  /*创建互斥锁*/
  xHandleSemaphoreMutex = xSemaphoreCreateMutex();
  
  if(xHandleSemaphoreCounting == NULL)
  {
    printf("create counting semaphore failed\r\n");
  }
  
  if(xHandleSemaphoreBinary == NULL)
  {
    printf("create binary semaphore failed\r\n");
  }
  else
  {
    /*先释放一次*/
    xSemaphoreGive(xHandleSemaphoreBinary);
  }
  
  if(xHandleSemaphoreMutex == NULL)
  {
    printf("create mutex semaphore failed\r\n");  
  }
  
  /*创建10个uint8_t型的消息队列*/
  xQueue1 = xQueueCreate(10, sizeof(uint8_t));
  if(xQueue1 == NULL)
  {
    printf("create xQueue1 failed\r\n");
  }
  else
  {
    printf("create xQueue1 success\r\n");
  }
  /*创建10个存储指针变量的消息队列*/
  xQueue2 = xQueueCreate(10, sizeof(struct Msg *));
  if(xQueue2 == NULL)
  {
    printf("create xQueue2 failed\r\n");
  }
  else
  {
    printf("create xQueue2 success\r\n");
  }
  /*创建软件定时器*/
  uint8_t i;
  const TickType_t xTimerPer[2] = {1000, 1000};
  
