Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
  for(i = 0; i < 2; i++)
  {
    xTimers[i] = xTimerCreate("Timer",                  /*定时器名字*/ 
                              xTimerPer[i],             /*定时器周期，单位时钟节拍*/ 
                              pdTRUE,                   /*周期性*/
                              (void *)i,                /*定时器ID*/
                              vTimerCallback);          /*定时器回调函数*/
    
    if(xTimers[i] == NULL)
    {
      printf("create software timer failed , ID = %d\r\n", i);
    }
    else
    {
      if(xTimerStart(xTimers[i], 100) != pdPASS)
      {
        printf("timer start failed, ID = %d\r\n", i);
      }
    }
  }
  /*创建事件标志组*/
  xHandleEventGroup = xEventGroupCreate();
  
  if(xHandleEventGroup == NULL)
  {
    /*事件标志组没有创建成功*/
    printf("xEventGroupCreate failed\r\n");
  }
}


/*
*********************************************************************************************************
* �? �? �?: vTaskTaskUserIF
* 功能说明: 接口消息处理，这里用�? LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 1 (数�?�越小优先级越低，这个跟 uCOS 相反)
*********************************************************************************************************
*/
static void vTaskTaskUserIF(void *pvParameters)
{
  
  uint8_t pcWriteBuffer[500];
  EventBits_t uxBits;
  
  uint8_t ucCount = 0;
  
  MSG_T *ptMsg;
  
  ptMsg = &g_tMsg;
  ptMsg->ucMessageID = 0;
  ptMsg->ulData[0] = 0;
  ptMsg->usData[0] = 0;
  //uint8_t buff[2048];
  
  while(1)
  {
    
    
    if(UserButtonStatus == 1)
    {
      //UserButtonStatus = 0;
      //xSemaphoreTake(xHandleSemaphoreMutex, portMAX_DELAY);
      printf("============================================================\r\n");
      printf("TaskName TaskStatus Priority RemainStack TaskID\r\n");
      vTaskList((char *)pcWriteBuffer);
      printf("%s\r\n", pcWriteBuffer);
      
      printf("\r\nTaskName      RunCount       Usage\r\n");
      vTaskGetRunTimeStats((char *)pcWriteBuffer);
      printf("%s\r\n", pcWriteBuffer);
      
      RTC_CalendarShow();
      
      AXISRAMBuf[0] = AXISRAMCount++;
      AXISRAMBuf[5] = AXISRAMCount++;
      AXISRAMBuf[9] = AXISRAMCount++;
      printf("UserButtonStatus = 1, AXISRAMBuf[0] = %d, AXISRAMBuf[5] = %d, AXISRAMBuf[9] = %d\r\n",AXISRAMBuf[0], AXISRAMBuf[5], AXISRAMBuf[9]);
      //xSemaphoreGive(xHandleSemaphoreMutex);
      
    }
    else if(UserButtonStatus == 2)
    {
      //xSemaphoreTake(xHandleSemaphoreMutex, portMAX_DELAY);
      printf("UserButtonStatus = 2\r\ndelete led task\r\n");
      if(xHandleTaskLED != NULL)
      {
        vTaskDelete(xHandleTaskLED);
        xHandleTaskLED = NULL;
      }
      
      D2SRAMBuf[0] = D2SRAMCount++;
      D2SRAMBuf[5] = D2SRAMCount++;
      D2SRAMBuf[9] = D2SRAMCount++;
      printf("UserButtonStatus = 2, D2SRAMBuf[0] = %d, D2SRAMBuf[5] = %d, D2SRAMBuf[9] = %d\r\n",D2SRAMBuf[0], D2SRAMBuf[5], D2SRAMBuf[9]);
    
      printf("UserButtonStatus = 2, send semaphore to vTaskMsgPro\r\n");
      //xSemaphoreGive(xHandleSemaphoreMutex);
      xSemaphoreGive(xHandleSemaphoreCounting);
      printf("UserButtonStatus = 2, send MUTEX to vTaskStart\r\n");
      xTaskNotifyGive(xHandleTaskStart);
    }
    else if(UserButtonStatus == 3)
    {
      //xSemaphoreTake(xHandleSemaphoreMutex, portMAX_DELAY);
      printf("UserButtonStatus = 3\r\ncreate led task\r\n");
      if(xHandleTaskLED == NULL)
      {
        xTaskCreate(  vTaskLED,
                        "vTaskLED",
                        512,
                        NULL,
                        2,
                        &xHandleTaskLED);
      }
      D3SRAMBuf[0] = D3SRAMCount++;
      D3SRAMBuf[5] = D3SRAMCount++;
      D3SRAMBuf[9] = D3SRAMCount++;
      printf("UserButtonStatus = 3, D3SRAMBuf[0] = %d, D3SRAMBuf[5] = %d, D3SRAMBuf[9] = %d\r\n",D3SRAMBuf[0], D3SRAMBuf[5], D3SRAMBuf[9]);
      printf("***********************************************************************************\r\n");
      printf("UserButtonStatus = 3, send task notify give to xHandleTaskMsgPro\r\n");
      xTaskNotifyGive(xHandleTaskMsgPro);
      //xSemaphoreGive(xHandleSemaphoreMutex);
    }
    else if(UserButtonStatus == 4)
    {
      taskENTER_CRITICAL();
      printf("UserButtonStatus = 4\r\nsuspend led task\r\n");
      vTaskSuspend(xHandleTaskLED);
      BKPSRAMBuf[0] = BKPSRAMCount++;
      BKPSRAMBuf[5] = BKPSRAMCount++;
      BKPSRAMBuf[9] = BKPSRAMCount++;
      printf("UserButtonStatus = 3, BKPSRAMBuf[0] = %d, BKPSRAMBuf[5] = %d, BKPSRAMBuf[9] = %d\r\n",BKPSRAMBuf[0], BKPSRAMBuf[5], BKPSRAMBuf[9]);
      taskEXIT_CRITICAL();
      
    }
    else if(UserButtonStatus == 5)
    {
      printf("UserButtonStatus = 5\r\nresume led task\r\n");
      HAL_TIM_Base_Start_IT(&htim17);
      //vTaskResume(xHandleTaskLED);
    }
    else if(UserButtonStatus == 6)
    {
      /*
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_0);
      if((uxBits & SET_BIT_0) != 0)
      {
        printf("UserButtonStatus = 6, event group bit 0 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 6, event group bit 0 was not setted\r\n");
      }
      */
      //printf("UserButtonStatus = 6\r\nsuspend iwdg feed task\r\n");
      //vTaskSuspend(xHandleTaskIwdg);
    }
    else if(UserButtonStatus == 7)
    {
      /*
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_1);
      if((uxBits & SET_BIT_1) != 0)
      {
        printf("UserButtonStatus = 7, event group bit 1 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 7, event group bit 1 was not setted\r\n");
      }
      */
      vTaskResume(xHandleTaskStart);
      //printf("UserButtonStatus = 7\r\nresume iwdg feed task\r\n");
      //vTaskResume(xHandleTaskIwdg);
    }
    else if(UserButtonStatus == 8)
    {
      vTaskSuspendAll(); /*开启调度锁*/
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_0);
      if((uxBits & SET_BIT_0) != 0)
      {
        printf("UserButtonStatus = 8, event group bit 0 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 8, event group bit 0 was not setted\r\n");
      }
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_1);
      if((uxBits & SET_BIT_1) != 0)
      {
        printf("UserButtonStatus = 8, event group bit 1 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 8, event group bit 1 was not setted\r\n");
      }
      if(xTaskResumeAll() == pdTRUE) /*关闭调度锁，如果需要任务切换，此函数返回pdTRUE*/
      {
        taskYIELD();
      }
      //printf("UserButtonStatus = 8\r\nsuspend wwdg feed task\r\n");
      //vTaskSuspend(xHandleTaskWwdg);
    }
    else if(UserButtonStatus == 9)
    {
      ucCount++;
      if(xQueueSend(xQueue1,
                    (void *) &ucCount,
                    (TickType_t)10) != pdPASS)
      {
        /*发送失败*/
        printf("UserButtonStatus = 9, xQueue1Send ucCount failed\r\n");
      }
      else
      {
        printf("UserButtonStatus = 9, xQueue1Send ucCount success\r\n");
      }
      printf("UserButtonStatus = 9, set vTaskLED priority to 5\r\n");
      vTaskPrioritySet(xHandleTaskLED, 5);
      printf("vTaskLED priority is now setted to %d\r\n", (int)uxTaskPriorityGet(xHandleTaskLED));
      
      printf("UserButtonStatus = 9, start tim15 for sending event\r\n");
      printf("*********************************************************************\r\n");
      printf("UserButtonStatus = 9, start tim15 for sending semaphore\r\n");
      //printf("*********************************************************************\r\n");
      //printf("UserButtonStatus = 9, start tim15 for sending MUTEX\r\n");
      HAL_TIM_Base_Start_IT(&htim15);
      //printf("UserButtonStatus = 9\r\nresume wwdg feed task\r\n");
      //vTaskResume(xHandleTaskWwdg);
    }
    else if(UserButtonStatus == 10)
    {
      ptMsg->ucMessageID++;
      ptMsg->ulData[0]++;
      ptMsg->usData[0]++;
      
      if(xQueueSend(xQueue2, 
                    (void *)&ptMsg,
                    (TickType_t)10) != pdPASS)
      {
        printf("UserButtonStatus = 10, xQueue2Send MSG_T failed\r\n");
      }
      else
      {
        printf("UserButtonStatus = 10, xQueue2Send MSG_T success\r\n");
      }
      printf("UserButtonStatus = 10, set vTaskLED priority to 1\r\n");
      vTaskPrioritySet(xHandleTaskLED, 1);
      printf("vTaskLED priority is now setted to %d\r\n", (int)uxTaskPriorityGet(xHandleTaskLED));
      
      printf("UserButtonStatus = 10, start tim16 for sending event\r\n");
      printf("*********************************************************************\r\n");
      printf("UserButtonStatus = 10, start tim6 for sending MUTEX\r\n");
      HAL_TIM_Base_Start_IT(&htim16);
    }
    else if(UserButtonStatus == 11)
    {
        printf("------------------------------------------------------------------\r\n");
        printf("UserButtonStatus = 11, set task notify event group bit 0\r\n");
        xTaskNotify(xHandleTaskWwdg, (1 << 0), eSetBits);
      
