Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
    }
    else if(UserButtonStatus == 12)
    {
        printf("------------------------------------------------------------------\r\n");
        printf("UserButtonStatus = 12, set task notify event group bit 1\r\n");
        xTaskNotify(xHandleTaskWwdg, (1 << 1), eSetBits);
    }
    else if(UserButtonStatus == 13)
    {
        /*按键中断发送BIT2的事件标志*/
    }
    else if(UserButtonStatus == 14)
    {
        ucCount++;
        printf("UserButtonStatus = 14, send task mail 'ucCount = %d' with overwrite to TaskIwdg\r\n", ucCount);
        xTaskNotify(xHandleTaskIwdg, ucCount, eSetValueWithOverwrite);
    }
    else if(UserButtonStatus == 15)
    {
        ucCount++;
        printf("UserButtonStatus = 15, send task mail 'ucCount = %d' without overwrite to TaskIwdg\r\n", ucCount);
        if(xTaskNotify(xHandleTaskIwdg, ucCount, eSetValueWithoutOverwrite) == pdPASS)
        {
          printf("vTaskIwdg message mail is updated\r\n");
        }
        else
        {
          printf("vTaskIwdg message mail can not be updated\r\n");
        }
    }
    else if(UserButtonStatus == 16)
    {
        /*按键中断发送消息邮箱 覆盖方式*/
        
    }
    else if(UserButtonStatus == 17)
    {
        /*按键中断发送消息邮箱 非覆盖方式*/
    }
    else if(UserButtonStatus == 18)
    {
      printf("current free heap size = %d\r\n", xPortGetFreeHeapSize());
      ptMsg = (MSG_T *)pvPortMalloc(sizeof(MSG_T));
      printf("free heap size after malloc = %d\r\n", xPortGetFreeHeapSize());
      
      ptMsg->ucMessageID = 88;
      ptMsg->ulData[0] = 89;
      ptMsg->usData[0] = 8;
      
      if(xQueueSend(xQueue3, (void *)&ptMsg, (TickType_t)10) != pdPASS)
      {
        printf("xQueue3 Sending failed\r\n");
        vPortFree(ptMsg);
        printf("free heap size after free = %d\r\n", xPortGetFreeHeapSize());
      }
      else
      {
        printf("xQueue3 Sending success\r\n");
        vPortFree(ptMsg);
        printf("free heap size after free = %d\r\n", xPortGetFreeHeapSize());
      }
      
    }
    else if(UserButtonStatus == 19)
    {
        printf("JumpToBootloader\r\n");
        JumpToBootLoader();
    }
    else
    {
      UserButtonStatus = 0;
      printf("UserButtonStatus reset to 0\r\n");
    }
    //xSemaphoreGive(xHandleSemaphoreMutex);
    vTaskSuspend(xHandleTaskUserIF);
    vTaskDelay(20);
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskLED
* 功能说明: LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 2
*********************************************************************************************************
*/
static void vTaskLED(void *pvParameters)
{
  MSG_T *ptMsg;
  BaseType_t xResult;
  const TickType_t xMaxBlockTime = pdMS_TO_TICKS(200);
  
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 1000;
  
  xLastWakeTime = xTaskGetTickCount();
  
  
  while(1)
  {
    //vTaskSuspendAll(); /*开启调度锁*/
    
    xResult = xQueueReceive(xQueue2,
                            (void *)&ptMsg,
                            (TickType_t)xMaxBlockTime);
    
    if(xResult == pdPASS)
    {
      //printf("msg queue receive success: ptMsg->ucMessageID = %d\r\n", ptMsg->ucMessageID);
      //printf("msg queue receive success: ptMsg->usData[0] = %d\r\n", ptMsg->usData[0]);
      //printf("msg queue receive success: ptMsg->ulData[0] = %d\r\n", ptMsg->ulData[0]);
      
    }
    else
    {
      //printf("receive queue2 msg failed\r\n");
    }
    
    xResult = xQueueReceive(xQueue2,
                            (void *)&ptMsg,
                            (TickType_t)xMaxBlockTime);
    
    if(xResult == pdPASS)
    {
      //printf("======================================================================================\r\n");
      //printf("msg queue receive success: ptMsg->ucMessageID = %d\r\n", ptMsg->ucMessageID);
      //printf("msg queue receive success: ptMsg->usData[1] = %d\r\n", ptMsg->usData[1]);
      //printf("msg queue receive success: ptMsg->ulData[1] = %d\r\n", ptMsg->ulData[1]);
    }
    else
    {
      //printf("receive queue2 msg failed\r\n");
    }
    
    //printf("now suspend all, vTaskLED working\r\n");
    //printf("xLastWakeTime = %d\r\n", xLastWakeTime);
    BSP_LED_Toggle(LED1);
    //BSP_LED_Toggle(LED2);
    //BSP_LED_Toggle(LED3);
    //RTC_CalendarShow();
    
#if 0
    if(xTaskResumeAll() == pdTRUE) /*关闭调度锁，如果需要任务切换，此函数返回pdTRUE*/
    {
      taskYIELD();
    }
    printf("after vTaskResumeAll\r\n");
#endif
    vTaskDelayUntil(&xLastWakeTime, xFrequency);
    
    
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskMsgPro
* 功能说明: 信息处理
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 3
*********************************************************************************************************
*/
static void vTaskMsgPro(void *pvParameters)
{
  BaseType_t xResult;
  const portTickType xMaxBlockTime = pdMS_TO_TICKS(300); /*设置最大等待时间为300ms*/
  uint8_t ucQueueMsgValue;
  uint8_t uiQueueMsgValue;
  
  uint32_t ulNotifiedValue;
  
  static uint8_t frameBuffer[101] = {0};
  memset((char *)(&frameBuffer[1]), '2', 100);
  HAL_UART_Transmit_DMA(&huart6, "uart6 dma transmit success\r\n", strlen("uart6 dma transmit success\r\n"));
  //static uint8_t rcvBuf[5];
  //HAL_UART_Receive_DMA(&huart6, rcvBuf, 5);
  /* Invalidate cache prior to access by CPU */
  //SCB_InvalidateDCache_by_Addr ((uint32_t *)rcvBuf, 5);
  while(1)
  {
    xResult = xQueueReceive(xQueue1,
                            (void *)&ucQueueMsgValue,
                            (TickType_t)xMaxBlockTime);
    
    if(xResult == pdPASS)
    {
      //printf("receive queue1 msg success\r\n");
      //printf("ucQueueMsgValue = %d\r\n", ucQueueMsgValue);
    }
    else
    {
      //printf("receive queue1 msg failed\r\n");
    }
    
    xResult = xQueueReceive(xQueue1, (void *)&uiQueueMsgValue, (TickType_t)xMaxBlockTime);
    
    if(xResult == pdPASS)
    {
      //printf("receive queue1 msg success\r\n");
      //printf("uiQueueMsgValue = %d\r\n", uiQueueMsgValue);
    }
    else
    {
      //printf("receive queue1 msg failed\r\n");
    }
    
    //HAL_UART_Transmit_DMA(&huart7, "uart7 dma transmit success\r\n", strlen("uart6 dma transmit success\r\n"));
    uart7ModeChange(GPIOMODE);
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_7, GPIO_PIN_RESET);
    delay_us(88);
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_7, GPIO_PIN_SET);
    delay_us(8);
    uart7ModeChange(UARTMODE);
    {
      HAL_UART_Transmit(&huart7, frameBuffer, 100, 0xff);
    }
    
    xResult = xSemaphoreTake(xHandleSemaphoreCounting, (TickType_t)xMaxBlockTime);
    //xSemaphoreTake(xHandleSemaphoreMutex, portMAX_DELAY);
    if(xResult == pdTRUE)
    {
      printf("TaskMsgPro receive semaphore\r\n");
    }
    else
    {
      //printf("TaskMsgPro receive semaphore failed\r\n");
    }
    
