Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
    /*
        第一个参数设置为pdFALSE，任务vTaskMsgPro的TCB（任务控制块）中的变量ulNotifiedValue -1
        设置为pdTRUE就是清零
    */
    ulNotifiedValue = ulTaskNotifyTake(pdFALSE, (TickType_t)xMaxBlockTime);
    
    if(ulNotifiedValue > 0)
    {
      printf("Task Notify success , ulNotifiedValue = %d\r\n", ulNotifiedValue);
    }
    
    //xSemaphoreGive(xHandleSemaphoreMutex);
    vTaskDelay(1000);
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskStart
* 功能说明: 启动任务，也就是�?高优先级任务，这里用�? LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 4
*********************************************************************************************************
*/
static void vTaskStart(void *pvParameters)
{
  //uartDmaTest();
  uint8_t ucTest, *ptr8;
  uint16_t uiTest, *ptr16;
  uint32_t ulTest, *ptr32;
  PARAM_T tPara, *paraPtr;
  
  tPara.Baud485 = 0x5555AAAA;
  tPara.ParamVer = 0x99;
  tPara.ucBackLight = 0x7788;
  tPara.ucRadioMode = 99.99f;
  
  while(1)
  {
    if(UserButtonStatus == 6)
    {
      //xSemaphoreTake(xHandleSemaphoreMutex, portMAX_DELAY);
      taskDISABLE_INTERRUPTS();
      eraseCpuFlash((uint32_t)para_flash_area);
      
      ucTest = 0xAA;
      uiTest = 0x55AA;
      ulTest = 0x11223344;
      
      writeCpuFlash((uint32_t)para_flash_area, (uint8_t *)&ucTest, sizeof(ucTest));
      writeCpuFlash((uint32_t)para_flash_area + 32, (uint8_t *)&uiTest, sizeof(uiTest));
      writeCpuFlash((uint32_t)para_flash_area + 32 * 2, (uint8_t *)&ulTest, sizeof(ulTest));

      /* 读出数据并打�? */
      ptr8  = (uint8_t  *)(para_flash_area + 32*0);
      ptr16 = (uint16_t *)(para_flash_area + 32*1);
      ptr32 = (uint32_t *)(para_flash_area + 32*2);

      taskENABLE_INTERRUPTS();
      
      printf("userButtonStatus = 6\r\n");
      printf("write data: ucTest = %x, uiTest = %x, ulTest = %x\r\n", ucTest, uiTest, ulTest);
      printf("read data: ptr8 = %x, ptr16 = %x, ptr32 = %x\r\n", *ptr8, *ptr16, *ptr32);
      vTaskSuspend(xHandleTaskStart);
    }
    else if(UserButtonStatus == 7)
    {
      printf("userButtonStatus = 7\r\n");
      /* 擦除扇区 */
      eraseCpuFlash((uint32_t)para_flash_area);
      writeCpuFlash((uint32_t)para_flash_area, (uint8_t *)&tPara, sizeof(tPara));
      
      paraPtr = (PARAM_T *)((uint32_t)para_flash_area);
      
      printf("write data: Baud485=%x, ParamVer=%x, ucBackLight=%x, ucRadioMode=%f\r\n", 
              tPara.Baud485,
              tPara.ParamVer,
              tPara.ucBackLight,
              tPara.ucRadioMode);
				
      printf("read data: Baud485=%x, ParamVer=%x, ucBackLight=%x, ucRadioMode=%f\r\n", 
              paraPtr->Baud485,
              paraPtr->ParamVer,
              paraPtr->ucBackLight,
              paraPtr->ucRadioMode);
      vTaskSuspend(xHandleTaskStart);
    }
    //xSemaphoreGive(xHandleSemaphoreMutex);
    
    else if(UserButtonStatus == 2 | UserButtonStatus == 10)
    {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY); //设置为pdTRUE直接清零
    
        printf("vTaskStart receive task notify MUTEX\r\n");
    }

    vTaskDelay(10);
  }
}

static void vTaskIwdg(void *pvParameters)
{
  /*利用vTaskDelay实现vTaskDelayUntil*/
  TickType_t xDelay, xNextTime;
  const TickType_t xFrequency =  1000;
  
  /*获取第一次唤醒时间*/
  xNextTime = xTaskGetTickCount() + xFrequency;
  
  BaseType_t xResult;
  uint32_t ulValue;
  const TickType_t xMaxBlockTime = pdMS_TO_TICKS(500);
  
  while(1)
  {
    xResult = xTaskNotifyWait(0x00000000, 0xFFFFFFFF, &ulValue, xMaxBlockTime);
    
    if(xResult == pdPASS)
    {
      printf("vTaskIwdg get message from task message email : %d\r\n", ulValue);
    }
    //printf("use vTaskDelay to achieve vTaskDelayUntil(1000)\r\n");
    xDelay = xNextTime - xTaskGetTickCount();
    //计算下次唤醒时间
    xNextTime += xFrequency;
    
    if(xDelay <= xFrequency)
    {
      vTaskDelay(xDelay);
    }
  }
#if 0
    if(HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
    {
      printf("iwdg feed error\r\n");
    }
    else
    {
      //printf("iwdg feed success\r\n");
    }
#endif
    
  
}

static void vTaskWwdg(void *pvParameters)
{
  EventBits_t uxBits;
  const TickType_t xTicksToWait = 100  / portTICK_PERIOD_MS;  /*100ms*/
  uint32_t ulValue;
  BaseType_t xResult;
  
  while(1)
  {
    uxBits = xEventGroupWaitBits(xHandleEventGroup, 
                                 SET_BIT_0 | SET_BIT_1, /*等待bit0和bit1被设置*/
                                 pdTRUE,                /*退出前bit0和bit1都被清除*/
                                 pdTRUE,                /*等待bit0和bit1都被设置*/
                                 xTicksToWait);         /*等待延迟时间*/
    
    if((uxBits & (SET_BIT_0 | SET_BIT_1)) == (SET_BIT_0 | SET_BIT_1))
    {
      printf("receive event group bits: bit 0 and bit 1 was setted\r\n");
      BSP_LED_Toggle(LED2);
    }
    else
    {
      //printf("run overtime or bit not setted\r\n");
      //BSP_LED_Toggle(LED3);
    }
    
    xResult = xTaskNotifyWait(0x00000000, 0xFFFFFFFF, &ulValue, xTicksToWait);
    
    if(xResult == pdPASS)
    {
          if((ulValue & (1 << 0)) != 0)
          {
            printf("receive msg from task events group bit 0, ulNotifiedValue = 0x%08x\r\n", ulValue);
          }
      
          if((ulValue & (1 << 1)) != 0)
          {
            printf("receive msg from task events group bit 1, ulNotifiedValue = 0x%08x\r\n", ulValue);
          }
          
          if((ulValue & (1 << 2)) != 0)
          {
            printf("receive msg from task events group bit 2, ulNotifiedValue = 0x%08x\r\n", ulValue);
          }
      
    }
    
       MSG_T *ptMsg;
       BaseType_t xResult;
       const TickType_t xMaxBlockTime = pdMS_TO_TICKS(200);
       
       xResult = xQueueReceive(xQueue3, (void *)&ptMsg, (TickType_t)xMaxBlockTime);
       
       if(xResult == pdPASS)
       {
            printf("UserButtonStatus = 18, ptMsg->usMessageID = %d\r\n", ptMsg->ucMessageID);
            printf("UserButtonStatus = 18, ptMsg->ulData[0] = %d\r\n", ptMsg->ulData[0]);
            printf("UserButtonStatus = 18, ptMsg->usData[0] = %d\r\n", ptMsg->usData[0]);
       }
       else
       {
         
