Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
       }
    
                                 
    vTaskDelay(1);
#if 0
    vTaskDelay(wwdgDelayNum);
    if(HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
    {
      printf("Wwdg feed error\r\n");
    }
    else
    {
      //printf("Wwdg feed success\r\n");
    }
#endif
    
  }
}

#if 0
static void vTaskMsgPro2(void *pvParameters)
{
  while(1)
  {
    printf("vTaskMsgPro2 sending\r\n");
    vTaskDelay(1000);
  }
}
#endif

static void AppTaskCreate(void)
{
  xTaskCreate(vTaskTaskUserIF,          /*任务函数*/
              "vTaskUserIF",            /*任务�?*/
              512,                      /*stack大小，单位word，也就是4字节*/
              NULL,                     /*任务参数*/
                3,                        /*任务优先�?*/
              &xHandleTaskUserIF);      /*任务句柄*/
  
  xTaskCreate(vTaskLED,          /*任务函数*/
            "vTaskLED",              /*任务�?*/
            512,                       /*stack大小，单位word，也就是4字节*/
            NULL,                      /*任务参数*/
            2,                         /*任务优先�?*/
            &xHandleTaskLED);       /*任务句柄*/
    
  xTaskCreate(vTaskMsgPro,          /*任务函数*/
          "vTaskMsgPro",            /*任务�?*/
          512,                      /*stack大小，单位word，也就是4字节*/
          NULL,                     /*任务参数*/
          3,                        /*任务优先�?*/
          &xHandleTaskMsgPro);      /*任务句柄*/
      
  xTaskCreate(vTaskStart,          /*任务函数*/
        "vTaskStart",            /*任务�?*/
        512,                      /*stack大小，单位word，也就是4字节*/
        NULL,                     /*任务参数*/
        4,                        /*任务优先�?*/
        &xHandleTaskStart);      /*任务句柄*/
  
#if 1
    xTaskCreate(vTaskIwdg,          /*任务函数*/
              "vTaskIwdg",            /*任务�?*/
              512,                      /*stack大小，单位word，也就是4字节*/
              NULL,                     /*任务参数*/
              5,                        /*任务优先�?*/
              &xHandleTaskIwdg);      /*任务句柄*/
    
    xTaskCreate(vTaskWwdg,
                "vTaskWwdg",
                512,
                NULL,
                5,
                &xHandleTaskWwdg
                );
#endif
    
#if 0
    xTaskCreate(vTaskMsgPro2,
                "vTaskMsgPro2",
                512,
                NULL,
                5,
                &xHandleTaskMsgPro2
                );
#endif
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART6_UART_Init();
  MX_UART7_Init();
  MX_TIM17_Init();
  MX_TIM16_Init();
  MX_TIM15_Init();
  /* USER CODE BEGIN 2 */
  //__set_PRIMASK(1);
  COM_InitTypeDef ComInitStruct;
  ComInitStruct.BaudRate = 115200;
  ComInitStruct.HwFlowCtl = COM_HWCONTROL_NONE;
  ComInitStruct.Parity = COM_PARITY_NONE;
  ComInitStruct.StopBits = COM_STOPBITS_1;
  ComInitStruct.WordLength = COM_WORDLENGTH_8B;
  
  extern UART_HandleTypeDef hcom_uart[COMn];
  BSP_COM_Init(COM1, &ComInitStruct);
  HAL_UART_Transmit(hcom_uart, "stlink uart test\r\n", strlen("stlink uart test\r\n"), 0xff);
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Init(LED3);
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  timer4DebugInit();
  //iwdgInit();
  //wwdgInit();
  rtcTimeStampInit();
    
  
  /*创建任务*/
  AppTaskCreate();
  
  AppObjCreate();
  
  /*启动调度，开始执行任�?*/
  vTaskStartScheduler();
  /* USER CODE END 2 */

  /* Init scheduler */
  //osKernelInitialize();

  /* Call init function for freertos objects (in cmsis_os2.c) */
  //MX_FREERTOS_Init();

  /* Start scheduler */
  //osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == BUTTON_USER_PIN)
  {  
    BaseType_t xYieldRequired;
    UserButtonStatus ++;
    xYieldRequired = xTaskResumeFromISR(xHandleTaskUserIF);
    
    if(xYieldRequired == pdTRUE)
    {
      portYIELD_FROM_ISR(xYieldRequired);
    }
    
    if(UserButtonStatus == 13)
    {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      printf("UserButtonStatus = 13, set task notify event group bit 2\r\n");
      xTaskNotifyFromISR(xHandleTaskWwdg, (1 << 2), eSetBits, &xHigherPriorityTaskWoken);
      
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    else if(UserButtonStatus == 16)
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        /*按键中断发送消息邮箱 覆盖方式*/
        printf("ISR send task message mail with overwrite 'UserButtonStatus %d'\r\n", UserButtonStatus);
        xTaskNotifyFromISR(xHandleTaskIwdg, UserButtonStatus, eSetValueWithOverwrite, &xHigherPriorityTaskWoken);
        
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    else if(UserButtonStatus == 17)
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        /*按键中断发送消息邮箱 非覆盖方式*/
        printf("ISR send task message mail without overwrite 'UserButtonStatus %d\r\n", UserButtonStatus);
        xTaskNotifyFromISR(xHandleTaskIwdg, UserButtonStatus, eSetValueWithoutOverwrite, &xHigherPriorityTaskWoken);
      
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
  }
}
/* USER CODE END 4 */

