Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x24000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x30000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_128KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x30020000;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
  MPU_InitStruct.BaseAddress = 0x30040000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_32KB;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER4;
  MPU_InitStruct.BaseAddress = 0x38000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_64KB;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */
  static uint32_t g_uiCount = 0;
  
  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
  BaseType_t xYieldRequired;
  UBaseType_t uxSavedInterruptStatus;
  if(htim->Instance == TIM17)
  {
    HAL_TIM_Base_Stop_IT(&htim17);
    uxSavedInterruptStatus = portSET_INTERRUPT_MASK_FROM_ISR(); //进入临界区
    {
      printf("HAL_TIM_PeriodElapsedCallback: enter critical area\r\n");
        printf("uxSavedInterruptStatus = %d\r\n", (int)uxSavedInterruptStatus);
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR(uxSavedInterruptStatus); //退出临界区
    printf("HAL_TIM_PeriodElapsedCallback: exit critical area\r\n");
    
    xYieldRequired = xTaskResumeFromISR(xHandleTaskLED);
    
    if(xYieldRequired == pdTRUE)
    {
      printf("ISR Yield required\r\n");
      portYIELD_FROM_ISR(xYieldRequired);
    }
    
  }
  
  if(htim->Instance == TIM15)
  {
    BaseType_t xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    HAL_TIM_Base_Stop_IT(&htim15);
    
    g_uiCount++;
    
    xQueueSendFromISR(xQueue1, (void *)&g_uiCount, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    
    xResult = xEventGroupSetBitsFromISR(xHandleEventGroup, SET_BIT_0, &xHigherPriorityTaskWoken);
    
    if(xResult != pdFAIL)
    {
      /*消息被成功发出*/
      printf("TIM15 ISR: set event group bit 0 succeed\r\n");
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    
    
    xSemaphoreGiveFromISR(xHandleSemaphoreCounting, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    
    printf("TIM15 send task notify to xHandleTaskMsgPro\r\n");
    vTaskNotifyGiveFromISR(xHandleTaskMsgPro, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    
    
    
  }
  
  if(htim->Instance == TIM16)
  {
    BaseType_t xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    MSG_T *ptMsg;
    
    HAL_TIM_Base_Stop_IT(&htim16);
    
    ptMsg->ucMessageID++;
    ptMsg->ulData[1]++;
    ptMsg->usData[1]++;
    
    xQueueSendFromISR(xQueue2, (void *)&ptMsg, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    
    xResult = xEventGroupSetBitsFromISR(xHandleEventGroup, SET_BIT_1, &xHigherPriorityTaskWoken);
    
    if(xResult != pdFAIL)
    {
      /*消息被成功发出*/
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    
    printf("TIM16 send task notify to xHandleTaskMsgPro\r\n");
    vTaskNotifyGiveFromISR(xHandleTaskMsgPro, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    
    printf("TIM16 send task notify MUTEX to xHandleTaskStart\r\n");
    vTaskNotifyGiveFromISR(xHandleTaskStart, &xHigherPriorityTaskWoken);
    
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
